#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сессия", Сессия);
	
	Если Не ЗначениеЗаполнено(Сессия) Тогда
		
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Не указан параметр ""Сессия""'");
	КонецЕсли;
	
	ТекстHTML = Отчеты.ОтчётПоПрохождениюТеста.ПолучитьМакетКакСтроку(Сессия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
