#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Формирует движения по регистру накопления БаллыОпыта при проведении документа.
//
Процедура ОбработкаПроведения(Отказ, Режим)

    Движения.БаллыОпыта.Записывать = Истина;
    Движение = Движения.БаллыОпыта.Добавить();
    Движение.Период        = Дата;
    Движение.Пользователь  = Обучающийся;
    Движение.Тема          = Тема;
    Движение.Причина       = Причина;
    Движение.Количество    = Количество;
    Движение.ИсточникСсылка = ИсточникСсылка;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
